# Jupyter and Pandas

Автор ноутбука - Дуркин Анатолий Альбертович

Преподаватель кафедры прикладной математики и компьютерных наук СГУ им. Питирима Сорокина

Замечания, предложения, идеи, вопросы, связь с автором:
- anatoliy.durkin@mail.ru
- Telegram - @AnatoDu

Больше информации и материалов на канале автора: https://t.me/smth_on_it

## Знакомимся с Юпитером

Инструмент - Jupyter Notebook (это ядро и в Google Colab, и в Yandex DataSphere, для локальной работы - Anaconda)

Файл - "ноутбук"

Удобство Jupyter в том, что ноутбук интерактивный, и тут можно работать с кодом по частям, что зачастую упрощает работу.

### Запускаем код

Приступим к работе.

Запишем в переменную простую строку. Код уже написан, чтобы запустить его. выделите ячейку и нажмите комбинацию Shift+Enter (либо кнопку запуска на панели вверху или над ячейкой (в зависимости от платформы), но комбинация удобнее, по-моему).

In [1]:
hello = 'Hello World!'

Если всё верно, возле ячейки, слева от кода, появилась цифра 1 (а может и была... но не будем об этом сейчас). Значит это первая ячейка ввода. Теперь выведем строку на экран, запустите следующую ячейку.

In [2]:
print(hello)

Hello World!

Получилось? Вывод оказывается сразу под ячейкой, очень удобно.

А теперь про интерактивность. Запустите следующую ячейку.

In [7]:
hello = 'Привет, Мир!'

А теперь вернитесь к ячейке с выводом, выделите её и запустите снова.

Если всё сделали правильно, то вывод теперь показывает русский текст, а номер ячейки увеличился до 4 (или у вас больше?). Всё верно, ячейки можно запускать в любом порядке, при этом ноутбук запоминает всё, что происходило. Крайне удобно!

<hr>

Ах да, стоит сказать сразу. Можно сбросить весь ноутбук и перезапустить его. для этого нужно остановить ядро (Kernel) и запустить заново. Тогда всё, что ноутбук запоминал, сбросится. А у ячеек с кодом не будет чисел. Нужные кнопки можете поискать самостоятельно в своей среде.

И ещё одно удобство Jupyter - если вы хотите посмотреть содержимое переменной, не обязательно писать "print", можно просто написать имя переменной, как в следующей ячейке.

In [8]:
hello

'Привет, Мир!'

Однако, работает это только к последней переменной, все предыдущие выводы в той же ячейке всё же потребуют волшебного слова. Сравните выводы двух следующих ячеек. (Да, выводится не только при запросе по имени, выводится результат выполнения последней строки)

In [9]:
hello
hello

'Привет, Мир!'

In [10]:
print(hello)
hello

Привет, Мир!

'Привет, Мир!'

### Куда писать код

Конечно, запустить код не составляет проблем, однако, как получить новую ячейку, чтобы этот код написать? Всё очень просто. Есть, конечно, кнопки на панели (наверно, я не знаю, где они, я ими не пользуюсь), но можно воспользоваться и клавиатурой.

Необходимо выделить ячейку (не чтобы в ней миал курсор, а чтобы вся выделилась), а затем нажать, что требуется:

- A - добавить ячейку с кодом сверху
- B - добавить ячейку с кодом снизу
- M - поменять код на Markdown (об этом чуть позже)
- Y - поменять Markdown на код

Есть ещё, при необходимости можете и сами найти быстрые клавиши и дополнить список (когда узнаете, как дополнить, хотя, вы, пожалуй, и сами легко с таким управитесь, если лень читать дальше). А пока можете побаловаться этими клавишами.

In [11]:
a = 3
b = 5
a + b

8

### Назвал Markdown - объясняй!

Markdown - облегчённый язык разметки. Он действительно очень простой, но позволяет навести красоту в текстовых ячейках.

Да, чтобы посмотреть внутрянку текстовых ячеек и дописывать их, то на них просто нужно нажать два раза. И весь Markdown как на ладони. А потом запустите ячейку - и красота!

Можете посмотреть в ячейках выше, как создаются заголовки, списки и прочее.

Заголовки - несколько решёточек, от их количества зависит уровень заколовка (некоторыедополнения к Jupyter позволяют заголовки автоматически нумеровать и даже сворачивать разделы, удобно!).

Списки - просто строки с черточками или нумерацией (даже многоуровневые легко делать, просто сдвигаем, но загляните внутрь, всё хитрее, чем кажется):

1. Список
2. Начинается
   1. И
   2. Продолжается

А ещё текстовые ячейки прекрасно понимают HTML, ещё больше простора для наведения красоты!

<hr>
<b>Полужирный</b> и <i>курсивный</i> текст.

Может вы ещё всмопните теги? А то я все забыл... Поиграйтесь.

Ну и раз о красоте говорим, то $\TeX$ тут тоже воспринимается. Все формулы будут ослеплять своим великолепием!

$$f'_{x} = \frac{\partial f}{\partial x}$$

Есть где разгуляться! Можно побаловаться, а затем перейдём к питону и его библиотеке.

## Медведи в очках

Нет-нет, они нам не нужны, просто библиотека, крайне полезная для анализа данных, машинного обучения и т.д. и т.п. называется Pandas (название происходит от PANel DAta, а не от вышеупомянутых зверушек, Python, если что, тоже отношения к змеям не имеет).

Давайте подключим библиотеку.

In [12]:
import pandas as pd

В этой строке мы импортировали библиотеку Pandas под псевдонимом pd. Это сделано, потому что использование функций из библиотеки требует обращения к ней по названию. Pandas писать долго, а вот pd - сильно быстрее. Этот псевдоним употребляется везде. он очень устоявшийся, поэтому так его и следует использовать (хочется использовать другой, но не стоит).

Да, если вдруг эта библотека не установлена, то её очень легко установить. Даже не нужно переходить в консоль и куда-либо ещё - к команде установки нужно просто дописать восклицательный знак и всё!

In [13]:
!pip install pandas

Requirement already satisfied: pandas in /Users/admin/Desktop/СГУ/Введение в ИИ/venv_0/lib/python3.13/site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in /Users/admin/Desktop/СГУ/Введение в ИИ/venv_0/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/admin/Desktop/СГУ/Введение в ИИ/venv_0/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/admin/Desktop/СГУ/Введение в ИИ/venv_0/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/admin/Desktop/СГУ/Введение в ИИ/venv_0/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/admin/Desktop/СГУ/Введение в ИИ/venv_0/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

Подгрузили библотеку? Очень хорошо. 

Важное замечание! Рекомендуется все библиотеки подключать в самом начале ноутбука в одной ячейке - так проще понять, какие библотеки понадобятся, а не выискивать их потом в коде. В этом ноутбуке это не соблюдено, но уж простите мне это...

Дальше (хотя и раньше никто не запрещал) можете баловаться с ячейками, как пожелаете - ноутбук в вашем распоряжении. Главное, сути изложенного материала не теряйте. А баловаться я даже рекомендую - опробуйте всё, что только возможно!

### Новые структуры хранения данных и их создание

Pandas открывает доступ к замечательным структурам - Series и DataFrame.

- Series - это одномерный массив с ключами-индексами. Похож на словарь.
- DataFrame - многомерный массив, где каждый столбец преставляет собой Series.

Но, давайте лучше посмотрим, как они выглядят на практике. Создадим Series.

In [31]:
fruits = pd.Series(['apple', 'orange', 'mango'], name='fruits')
fruits

0     apple
1    orange
2     mango
Name: fruits, dtype: object

Смотрите, у нас сами собой появились индексы. По умолчанию это числовой ряд с нуля, однако его можно задать вручную.

In [32]:
code = [11, 43, 77]
region = ['Komi', 'Kirov', 'Moscow']

codes = pd.Series(data=region, index=code)
codes

11      Komi
43     Kirov
77    Moscow
dtype: object

Теперь и индексы можно задавать самостоятельно. И они не обязательно должны быть числами.

In [39]:
codes_2 = pd.Series(data=code, index=region, name='regions')
codes_2

Komi      11
Kirov     43
Moscow    77
Name: regions, dtype: int64

По индексу мы всегда можем обратиться и получить значение в данной строке серии.

In [40]:
codes[11]

'Komi'

In [45]:
print(codes_2['Kirov'])
codes_2['Kirov']

43

np.int64(43)

Вообще, это краткая запись обращения, а полная использует метод loc, он позволяет больше в некоторых случаях (особенно при работе с DataFrame, но об этом чуть позже).

In [46]:
codes.loc[11]

'Komi'

А вот если мы хотим какую-либо строку по порядку, то используем iloc (нумерация с нуля).

In [47]:
codes.iloc[1]

'Kirov'

И в продолжение индексов - срезы! Когда нам нужно получить часть серии - просто указываем первый и последний номер нужного отрезка (последний не войдёт). Дальше разные версии срезов, изучите внимательно, попробуйте сами (можете свою серию создать или расширить имеющиеся).

In [48]:
codes[0:2]

11     Komi
43    Kirov
dtype: object

In [49]:
codes[:2]

11     Komi
43    Kirov
dtype: object

In [50]:
codes[1:]

43     Kirov
77    Moscow
dtype: object

In [51]:
codes[1:1]
# Последний не войдёт

Series([], dtype: object)

In [52]:
codes[-2:]
# Да, срезы можно делать с конца именно так

43     Kirov
77    Moscow
dtype: object

In [53]:
codes[:6]

11      Komi
43     Kirov
77    Moscow
dtype: object

In [54]:
codes[::2]
# А третье число отвечает за частоту выборки элементов, тут каждый второй

11      Komi
77    Moscow
dtype: object

А теперь давайте посмотрим на создание DataFrame.

In [61]:
students = ['Ivanov', 'Petrov', 'Sidorov']
subjects = ['Algebra', 'Geometry', 'Chemistry', 'Physics', 'History', 'Biology', 'Literature']
values = [[5, 4, 3], 
          [5, 3, 3], 
          [4, 5, 3], 
          [4, 4, 3], 
          [4, 5, 3],
          [4, 5, 3],
          [4, 4, 5]]

marks = pd.DataFrame(data=values, index=subjects, columns=students)
display(marks)
codes

            Ivanov  Petrov  Sidorov
Algebra          5       4        3
Geometry         5       3        3
Chemistry        4       5        3
Physics          4       4        3
History          4       5        3
Biology          4       5        3
Literature       4       4        5

11      Komi
43     Kirov
77    Moscow
dtype: object

Как видите, тут мы можем задать ещё названия столбцов. Обратите внимание на то, как двумерный список преобразуется в таблицу DataFrame, это происходит построчно. Это важно помнить, чтобы не создать случайно транспонированную таблицу.

Что за display? Да, можно было обойтись и без него, ведь последнюю строку Jupyter и так бы показал, но запомните эту функцию. Делает она то же самое, что и print, но фреймы выводит более красиво. Сравните со следующей ячейкой.

In [62]:
print(marks)

            Ivanov  Petrov  Sidorov
Algebra          5       4        3
Geometry         5       3        3
Chemistry        4       5        3
Physics          4       4        3
History          4       5        3
Biology          4       5        3
Literature       4       4        5

А теперь вновь пару слов об обращении к частям фрейма. В серии при простом обращении в квадратных скобках мы могли получить значение интересующей строки, во фреймах строку вы так не получите, только ошибку, а вот столбец - без проблем.

In [63]:
marks['Algebra']
# Вызывает ошибку KeyError, так как среди столбцов не находится столбец 'Algebra'

KeyError: 'Algebra'

In [64]:
marks['Petrov']

Algebra       4
Geometry      3
Chemistry     5
Physics       4
History       5
Biology       5
Literature    4
Name: Petrov, dtype: int64

А если требуются несколько столбцов, то мы не пишем несколько названий, а передаем список из этих столбцов, иначе получите ошибку.

In [65]:
marks['Petrov', 'Sidorov']

KeyError: ('Petrov', 'Sidorov')

In [66]:
marks[['Petrov', 'Sidorov']]

            Petrov  Sidorov
Algebra          4        3
Geometry         3        3
Chemistry        5        3
Physics          4        3
History          5        3
Biology          5        3
Literature       4        5

Тут самое время вспомнить про loc, он тут работает замечательно (iloc тоже).

In [77]:
display(marks.loc['Algebra'])
display(marks['Algebra':'Algebra'])

Ivanov     5
Petrov     4
Sidorov    3
Name: Algebra, dtype: int64

         Ivanov  Petrov  Sidorov
Algebra       5       4        3

А теперь можно сказать про полную форму этого метода, ведь в нём можно указать и индексы, и столбцы.

In [70]:
marks.loc['Algebra', 'Petrov']

np.int64(4)

С помощью этого метода можно даже делать срезы, главное быть аккуратными с индексами и столбцами.

In [78]:
display(marks.loc['Algebra':'Chemistry', 'Petrov':'Sidorov'].T)
marks.loc['Algebra':'Chemistry', 'Petrov':'Sidorov']

         Algebra  Geometry  Chemistry
Petrov         4         3          5
Sidorov        3         3          3

           Petrov  Sidorov
Algebra         4        3
Geometry        3        3
Chemistry       5        3

### Что расскажет DataFrame

У фреймов есть несколько замечательных методов, позволяющих быстро ознакомиться с данными и понять, что лежит внутри.

Как правило, смотрят на несколько первых строк, чтобы почитать их. Сейчас у нас маленький фрейм, но когда в нём тысячи строк, не имеет смысла выводить его весь (Jupyter и не сделает этого, он его сократит), но можно посмотреть несколько строк.

In [79]:
# Первые строки, по умолчанию 5 первых
marks.head()

           Ivanov  Petrov  Sidorov
Algebra         5       4        3
Geometry        5       3        3
Chemistry       4       5        3
Physics         4       4        3
History         4       5        3

In [80]:
# Но можно задать и свое число
marks.head(3)

           Ivanov  Petrov  Sidorov
Algebra         5       4        3
Geometry        5       3        3
Chemistry       4       5        3

In [81]:
# Последние строки
marks.tail()

            Ivanov  Petrov  Sidorov
Chemistry        4       5        3
Physics          4       4        3
History          4       5        3
Biology          4       5        3
Literature       4       4        5

In [91]:
# И случайный набор, тут по умолчанию одна строка, но можно запросить нужное количество
marks.sample(9, replace=True)

            Ivanov  Petrov  Sidorov
Algebra          5       4        3
Chemistry        4       5        3
Physics          4       4        3
Geometry         5       3        3
Geometry         5       3        3
Literature       4       4        5
Physics          4       4        3
History          4       5        3
Chemistry        4       5        3

Посмотрели на первые строки, что-то для себя поняли. Но часто в первых строках не видны тонкости. Можно посмотреть краткую информацию по фрейму.

In [106]:
marks.loc['Algebra', 'Petrov'] = None
marks

            Ivanov Petrov  Sidorov
Algebra          5   None        3
Geometry         5      3        3
Chemistry        4      5        3
Physics          4      4        3
History          4      5        3
Biology          4      5        3
Literature       4      4        5

In [107]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Algebra to Literature
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Ivanov   7 non-null      int64
 1   Petrov   6 non-null      object
 2   Sidorov  7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 524.0+ bytes

Получаем очень полезную таблицу. В ней указано, что имеется 7 записей с индексами от Algebra до Literature, а также три столбца, причём для каждого указано, сколько в столбце непустых значений, а также тип данных. У нас пропусков нет и везде целые числа int.

Давайте добавим пустое значение и посмотрим,что изменится. Заодно запомним. как через loc можно задавать значение.

In [111]:
marks.loc['Geometry', 'Sidorov'] = None

In [112]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Algebra to Literature
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Ivanov   7 non-null      int64
 1   Petrov   6 non-null      object
 2   Sidorov  6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 524.0+ bytes

В столбце Sidorov теперь и правда отмечается только 6 непустых значений. А вот тип данных почему-то поменялся на float. Дело в том, что None имеет тип float, а столбец в случае спорной ситуации всегда переходит к более широкому типу.

In [113]:
marks

            Ivanov Petrov  Sidorov
Algebra          5   None      3.0
Geometry         5      3      NaN
Chemistry        4      5      3.0
Physics          4      4      3.0
History          4      5      3.0
Biology          4      5      3.0
Literature       4      4      5.0

Пока у нас есть пустое значение, давайте посмотрим, как эти пустые значения искать, для этого есть свой метод.

In [114]:
marks.isna()

            Ivanov  Petrov  Sidorov
Algebra      False    True    False
Geometry     False   False     True
Chemistry    False   False    False
Physics      False   False    False
History      False   False    False
Biology      False   False    False
Literature   False   False    False

Мы получим True, если ячейка пустая. Правда, в таком виде не очень удобно. Но мы можем просто сложить числа по столбцам, при этом True считается за единицу, а False за ноль. Посмотрим на число пустых ячеек в столбцах.

In [115]:
marks.isna().sum()

Ivanov     0
Petrov     1
Sidorov    1
dtype: int64

Также во фреймах бывают дубликаты (иногда они оправданы, но чаще всего нет), и их тоже можно найти.

In [121]:
marks.duplicated()

Algebra       False
Geometry      False
Chemistry     False
Physics       False
Literature    False
dtype: bool

Если посмотри на сам фрейм, то увидим, что строки истории и биологии одинаковы по значениям и совпадают со строкой химии. Да, таблица просматривается сверху вниз, дубликатами помечаются те строки, которые идентичны уже встречавшимся сверху. Как посмотреть на количество дубликатов вы, наверно, уже догадались.

А я покажу, как их удалить (если это необходимо, конечно).

In [122]:
marks.drop_duplicates()

            Ivanov Petrov  Sidorov
Algebra          5   None      3.0
Geometry         5      3      NaN
Chemistry        4      5      3.0
Physics          4      4      3.0
Literature       4      4      5.0

Строк-дубликатов и правда нет, но, если мы вновь выведем фрейм...

In [123]:
marks

            Ivanov Petrov  Sidorov
Algebra          5   None      3.0
Geometry         5      3      NaN
Chemistry        4      5      3.0
Physics          4      4      3.0
Literature       4      4      5.0

Всё на месте. Дело в том, что метод удаляет дубликаты и создает новый фрейм без них. А чтобы сохранить изменения. их нужно записать. Это можно сделать прямым присваиванием, либо хитрым параметром.

In [124]:
marks.drop_duplicates(inplace=True)

In [125]:
marks

            Ivanov Petrov  Sidorov
Algebra          5   None      3.0
Geometry         5      3      NaN
Chemistry        4      5      3.0
Physics          4      4      3.0
Literature       4      4      5.0

Но помните, что inplace работает не во всех методах, требующих перезаписи, так что не забывайте о явном присваивании.

Непорядок, обнаружились ошибки в заполнении журнала. Давайте исправим оценки по геометрии у Петрова и Сидорова.

In [139]:
marks.loc['Geometry', ['Petrov', 'Sidorov']] = [4, 3]

In [140]:
marks

            Ivanov Petrov  Sidorov
Algebra          5   None        3
Geometry         5      4        3
Chemistry        4      5        3
Physics          4      4        3
Literature       4      4        5

Обратили внимание, как были заданы значения? Запоминайте все варианты.

Вот только тип данных последнего столбца не поменялся. Да, к более узкому типу данный столбцы автоматически не переводятся, но это всегда можно сделать вручную.

In [141]:
marks['Sidorov'] = marks['Sidorov'].astype('int')

In [142]:
marks

            Ivanov Petrov  Sidorov
Algebra          5   None        3
Geometry         5      4        3
Chemistry        4      5        3
Physics          4      4        3
Literature       4      4        5

Ранее мы уже складывали значения в столбцах. Но их можно не только складывать, есть несколько методов:

- count - количество непустых записей
- sum - сумма
- min - минимум
- max - максимум
- mean - среднее 
- median - медиана
- std - среднеквадратичное отклонение

Их можно применять как ко всему фрейму, так и к отдельным столбцам.

In [157]:
marks['Petrov'] = marks['Petrov'].astype('float')
print(marks['Petrov'].sum() / len(marks['Petrov']))
marks['Petrov'].mean()

3.4

np.float64(4.25)

Выполнять эти агрегирующие методы можно и по строкам, если указать ось выполнения.

In [158]:
marks.sum(axis=1)

Algebra        8.0
Geometry      12.0
Chemistry     12.0
Physics       11.0
Literature    13.0
dtype: float64

Скажем ещё об одном чудесном методе, позволяющем получить целый набор основных метрик, позволяющих делать выводы о данных. Что говорить, посмотрим. как он работает.

In [159]:
marks.describe()

         Ivanov  Petrov   Sidorov
count  5.000000    4.00  5.000000
mean   4.400000    4.25  3.400000
std    0.547723    0.50  0.894427
min    4.000000    4.00  3.000000
25%    4.000000    4.00  3.000000
50%    4.000000    4.00  3.000000
75%    5.000000    4.25  3.000000
max    5.000000    5.00  5.000000

Тут и количество, и среднее, и среднеквадратичное отклонение... Далее есть минимальное, максимальное значение и проценты какие-то... Это квартили. То есть в строке "25%" указано такое значение, что 25% всех значений столбца не больше этого значения, а 75% не меньше. Несложно догадаться, что 50% - это медиана.

К слову о квартилях. Эти квартили делят набор данных на 4 блока (поэтому и квартили), но вообще мы можем получить такое число для любого уровня - квантиль (а если идём по процентам, то можно назвать процентиль).

In [163]:
marks['Ivanov'].quantile(0.37)

np.float64(4.0)

Здесь мы посмотрели, какое число поделит наш набор данных так, чтобы 37% значений были не больше, а остальные не меньше этого числа.

Дробить можно сколько угодно, особенно в больших наборах данных с тысячами строк.

Обязательно стоит сказать о фильтрации данных. Когда мы хотим как-то отсеять часть информации, легко добавить фильтры. Ознакомьтесь со следующими ячейками, это очень просто.

In [164]:
marks[marks['Ivanov'] > 4]

          Ivanov  Petrov  Sidorov
Algebra        5     NaN        3
Geometry       5     4.0        3

In [165]:
marks[marks['Sidorov'] == marks['Sidorov'].max()]

            Ivanov  Petrov  Sidorov
Literature       4     4.0        5

Если же нужно два фильтра и более, то можно применять их последовательно, на что питон слегка возмутится, либо через логические операции (& - и, | - или, ~ - не). только важно взять сами фильтры в скобки, иначе получите ошибку.

In [166]:
marks[marks['Sidorov'] != 5][marks['Petrov'] != 5]

/var/folders/nn/nnrrnydn6z35nnsdqhvlhrj40000gn/T/ipykernel_36139/1612115017.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  marks[marks['Sidorov'] != 5][marks['Petrov'] != 5]

          Ivanov  Petrov  Sidorov
Algebra        5     NaN        3
Geometry       5     4.0        3
Physics        4     4.0        3

In [168]:
marks[(marks['Sidorov'] != 5) & (marks['Petrov'] != 5)]

          Ivanov  Petrov  Sidorov
Algebra        5     NaN        3
Geometry       5     4.0        3
Physics        4     4.0        3

Ещё одна чудесная функция. Например, мы хотим узнать, сколько каких оценок у Петрова. Это очень легко сделать, сосчитав количество следующей функцией.

In [172]:
print(marks['Petrov'].unique())
print(marks['Petrov'].nunique())

[nan  4.  5.]
2

In [173]:
marks['Petrov'].value_counts()

Petrov
4.0    3
5.0    1
Name: count, dtype: int64

Ох, чуть не забыл. Сортировка! Ведь сортировка по возрастанию или убыванию очень нужна, а выполняется очень просто.

In [174]:
marks['Petrov'].sort_values()

Geometry      4.0
Physics       4.0
Literature    4.0
Chemistry     5.0
Algebra       NaN
Name: Petrov, dtype: float64

In [175]:
# Или так
marks.sort_values('Petrov')

            Ivanov  Petrov  Sidorov
Geometry         5     4.0        3
Physics          4     4.0        3
Literature       4     4.0        5
Chemistry        4     5.0        3
Algebra          5     NaN        3

In [176]:
# И по убыванию
marks['Petrov'].sort_values(ascending=False)

Chemistry     5.0
Geometry      4.0
Physics       4.0
Literature    4.0
Algebra       NaN
Name: Petrov, dtype: float64

In [177]:
marks.Petrov

Algebra       NaN
Geometry      4.0
Chemistry     5.0
Physics       4.0
Literature    4.0
Name: Petrov, dtype: float64

## Пара слов о признаках

Когда мы изучаем датафрейм с целью анализа данных, то стоит понимать, какие признаки встречаются в столбцах. Их можно разделить на следующие группы:

1. Количественные
   1. Дискретные
   2. Непрерывные
2. Качественные (категориальные)
   1. Порядковые
   2. Номинальные

В чем их отличие?

Количественные признаки задаются числом. При этом дискретные задаются конкретными числами с неким шагом. Например, число студентов в аудитории мы можем описать только целыми неотрицательными числами. У нас не может сидеть полтора студента. А вот непрерывные признаки можно задать любым числом. Например, масса камня или скорость автомобиля.

Качественные признаки могут быть заданы текстово, либо числами, если отражают разбиение на категории. Например, наличие детей в семье, заданное числами 0 и 1 будет не количественным, а качественным признаком, хоть и указано числами. Порядковые признаки отражают некий порядок. Например, уровень образования: начальное, общее, среднее и т.д. А номинальные нельзя распределить по порядку. Примером этих признаков могут быть цвета воздушных шариков: красный. синий, зеленый...

Какие признаки в нашем фрейме с оценками?

## Работа с файлами

Как знакомиться с данными мы выяснили, но где данные брать? Чаще всего большие наборы или датасеты можно найти с разрешением .csv - Comma-Separated Values - значения, разделённые запятыми. Это удобный способ хранения данных. И Pandas легко может их прочитать, для это есть специальная функция (есть и для чтения excel и прочих файлов).

Один из самый популярных датасетов - titanic.csv, на нём многие учатся и тренируются. Это список пассажиров Титаника.

Чтобы подключить файл, мы просто должны указать путь до него в функции. В зависимости от платформы, где вы работаете, могут возникать тонкости процесса, но проще всего разместить файл в той же директории, что и этот ноутбук. Тогда проблем с подключением не будет. Положите titanic.csv в ту же папку и загрузите в ноутбук, выполнив следующий код.

In [231]:
df = pd.read_csv('../datasets/titanic.csv', index_col='PassengerId')
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Здесь мы также указали, что за столбец индексов нужно взять столбец 'PassengerId'. У функции много дополнительных параметров, с ними всегда можно ознакомиться в документации (для этой функции https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

Кстати, документация - крайне полезная вещь. Очень рекомендую всегда туда заглядывать, можно узнать много нового о знакомых функциях.

## Последнее плавание Титаника

Теперь у вас есть возможность разобраться со всеми изученными функциями и методами на примере полноценного датасета.

Я дам вам лишь объяснение значений столбцов.

Каждая строчка наборов данных содержит следующие поля:

- Survived — выжил ли пассажир;
- Pclass — класс пассажира (1 — высший, 2 — средний, 3 — низший);
- Name — имя;
- Sex — пол;
- Age — возраст;
- SibSp — количество братьев, сестер, сводных братьев, сводных сестер, супругов на борту титаника;
- Parch — количество родителей, детей (в том числе приемных) на борту титаника;
- Ticket — номер билета;
- Fare — плата за проезд;
- Cabin — каюта;
- Embarked — порт посадки (C — Шербур; Q — Квинстаун; S — Саутгемптон).

Теперь вы можете самостоятельно изучить весь набор. Примерный список вопросов для изучения:

- Размеры выборки, количество пассажиров;
- Типы данных в столбцах;
- Какие признаки в столбцах, количественные, качественные и т.д.;
- Стоит ли заменить тип данных в каких-то столбцах;
- Основные статистики для столбцов (средние, минимумы и максимумы и т.д.);
- Самые-самые (самые дорогие билеты, самые дешевые, самые взрослые пассажиры);
- Количество пассажиров по полу или классу;
- Прочее.

Сможете найти интересных пассажиров, странные вещи в датасете, удивительные факты? Потратьте время на изучение набора данных и отработку функций и методов. И, конечно, всегда можете искать другие функции, не описанные в данном ноутбуке.

Если у вас остаются вопросы или замечания, всегда можете связаться со мной по контактам, указанным в самом начале ноутбука.

In [232]:
display(df.head())
df.shape

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

(891, 11)

In [233]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

Количественные: Sex, Parch, Fare, SibSp

Категориальные: Survived, Pclass, Name, Sex, Ticket, Cabin, Embarked

Можно было бы заменить возраст на целочисленное значение, но для этого надо избавиться от пропусков

In [234]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

В строке max указаны максимальные значения для каждого числового столбца

In [235]:
df.groupby('Sex')['Name'].count()

Sex
female    314
male      577
Name: Name, dtype: int64

In [236]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [237]:
df['Fare'].sort_values(ascending=False).head()

PassengerId
259    512.3292
738    512.3292
680    512.3292
89     263.0000
28     263.0000
Name: Fare, dtype: float64

In [239]:
df[df['Survived'] == 1]['Survived'].count() #Выжившие

np.int64(342)